In [2]:
import pandas as pd
import mysql.connector

In [29]:
#Create Database datafellowshipIYKRA

mydb = mysql.connector.connect(host='localhost', user='root', password='franklampard8')
cur = mydb.cursor()

def create_database():
    cur.execute("CREATE DATABASE datafellowshipIYKRA")
    
create_database()

In [30]:
#Show databases to make sure a new database has been created

def show_databases():
    cur.execute("show databases")
    return cur.fetchall()

show_databases()

[('classicmodels',),
 ('coba',),
 ('consulting',),
 ('datafellowshipiykra',),
 ('db_epi',),
 ('db_lk',),
 ('db_puldatawas',),
 ('db_puldatawasnew',),
 ('db_reviu_lk',),
 ('db_rkakl',),
 ('db_simon',),
 ('db_sipedit',),
 ('db_sipinal',),
 ('db_sipinal_all',),
 ('db_sipinalnew',),
 ('db_sippisko',),
 ('dbsipinal',),
 ('dwh_eserap',),
 ('dwh_eserapp',),
 ('dwh_eserappp',),
 ('dwh_puldatawas',),
 ('dwh_reviu_lk',),
 ('dwh_rkakl',),
 ('dwh_sipinal',),
 ('dwh_sippisko',),
 ('eserap',),
 ('information_schema',),
 ('kampus',),
 ('kantor',),
 ('kemenkes',),
 ('multimatics',),
 ('mysql',),
 ('performance_schema',),
 ('phpmyadmin',),
 ('production',),
 ('store',),
 ('test',),
 ('toko',),
 ('universitas',)]

In [35]:
#Use datafellowshipIYKRA
def use_iykradatabase():
    cur.execute("USE datafellowshipIYKRA")
    
use_iykradatabase()

In [36]:
#Create transactions table
def create_table():
    cur.execute("""CREATE TABLE transactions 
                (id INT(100), 
                insert_time TIMESTAMP,
                tx_amount FLOAT(10), 
                tx_type VARCHAR(100), 
                status VARCHAR(100))""")
    
    cur.execute("DESCRIBE transactions")
    
    return cur.fetchall()

create_table()

[('id', 'int(100)', 'YES', '', None, ''),
 ('insert_time',
  'timestamp',
  'NO',
  '',
  'current_timestamp()',
  'on update current_timestamp()'),
 ('tx_amount', 'float', 'YES', '', None, ''),
 ('tx_type', 'varchar(100)', 'YES', '', None, ''),
 ('status', 'varchar(100)', 'YES', '', None, '')]

In [37]:
#insert values to transactions table

def insert_value():
    sql = """INSERT INTO transactions(id, insert_time, tx_amount, tx_type, status)
             VALUES (%s,%s,%s,%s,%s)"""
    val = [(1, '2021-07-01', 2000, 'buy', 'open'),
          (2, '2021-07-02', 3000, 'buy', 'open'),
          (3, '2021-07-03', 4000, 'buy', 'open'),
          (4, '2021-07-04', 5000, 'buy', 'open'),
          (1, '2021-07-05', 6000, 'sell', 'closed'),
          (2, '2021-07-06', 7000, 'sell', 'closed'),
          (3, '2021-07-07', 8000, 'sell', 'closed'),
          (4, '2021-07-08', 9000, 'sell', 'closed'),
          (5, '2021-07-09', 10000, 'buy', 'open'),
          (6, '2021-07-10', 11000, 'buy', 'open')]
    
    cur.executemany(sql, val)
    
    mydb.commit()
    
    print(cur.rowcount, "rows were inserted.")
    
insert_value()

10 rows were inserted.

In [41]:
#select the most updated transaction for each id

def most_updated_transactions():
    sql = """SELECT t.* FROM transactions t
             INNER JOIN
             (SELECT id, MAX(insert_time) AS Mostupdated
             FROM transactions GROUP BY id) s 
             ON t.id = s.id
             AND t.insert_time = s.mostupdated"""
    df = pd.read_sql_query(sql, con=mydb)
    
    return df

most_updated_transactions()

   id insert_time  tx_amount tx_type  status
0   1  2021-07-05     6000.0    sell  closed
1   2  2021-07-06     7000.0    sell  closed
2   3  2021-07-07     8000.0    sell  closed
3   4  2021-07-08     9000.0    sell  closed
4   5  2021-07-09    10000.0     buy    open
5   6  2021-07-10    11000.0     buy    open